Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: You can use the type(of:) function to find the dynamic type of a value, particularly when the dynamic type is different from the static type.
ja: あなたは、type(of:)を使うことである値の動的型を見つけることができます、とりわけ動的型が静的型と異なる場合に。

source: You can use the magnitude property in operations that are simpler to implement in terms of unsigned values, such as printing the value of an integer, which is just printing a ‘-’ character in front of an absolute value.
ja: あなたは、magnitudeプロパティを、ずっと単純に符号なしの値に関して実装する演算において使用できます、例えば整数の値を印字することなど、それはちょっと「-」文字を絶対値の前に印字しています。

source: You can use the conditional type cast operator (as?), which returns an optional value of the type you are trying to downcast to:
ja: あなたは、条件付き型キャスト演算子（as?）を使うことができます、それはあなたがそれへとダウンキャストを試みる型のオプショナル値を返します：

source: You can use the equal-to operator (==) to compare any two arrays that store the same, Equatable-conforming element type.
ja: あなたは、同等演算子（==）を使って同じ、Equatable準拠の、要素型を格納する任意の２つの配列を比較できます。

source: You can use the pattern-matching operator (~=) to test whether a value is included in a range.
ja: あなたは、このパターンマッチング演算子（~=）を使うことで、ある値がある範囲に含まれるかどうか検査できます。

source: You can use the predicate to check for an element of a type that doesn’t conform to the Equatable protocol, or to find an element that satisfies a general condition.
ja: あなたは述部を使うことで、Equatableプロトコルに準拠しない型の要素を調べること、またはある一般的条件を満たす要素を見つけることが可能です。

source: You can use the predicate to check for an element of a type that doesn’t conform to the Equatable protocol, such as the HTTPResponse enumeration in this example.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型、例えばこの例でのHTTPResponse列挙などの要素に対して調べることができます。

source: You can use the predicate to find an element of a type that doesn’t conform to the Equatable protocol or to find an element that matches particular criteria.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型の要素を見つける、または特定の基準に合致する要素を見つけることができます。

source: You can use the unary plus operator (+) to provide symmetry in your code for positive numbers when also using the unary minus operator.
ja: あなたは、単行プラス演算子（+）を使うことで、均整美をあなたのコードにおいて正の数に対して単行マイナス演算子もまた使う場合に提供できます。

source: You can use this function to call an API that takes an escaping closure in a way that doesn’t allow the closure to escape in practice.
ja: あなたはこの関数を使うことで、クロージャが脱出するのを実際には許可されないある方法において脱出クロージャをとるAPIを呼び出せます。

source: You can use this function to stride over values of any type that conforms to the Strideable protocol, such as integers or floating-point types.
ja: あなたは、この関数を使ってStrideableプロトコルに準拠する任意の型、例えば整数や浮動小数点型の値いくつかをまたいで越すことができます。

source: You can use this initializer to create an array from any other type that conforms to the Sequence protocol.
ja: あなたはこのイニシャライザを使って、Sequenceプロトコルに準拠する何か他の型から配列を作成することができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the partial range’s lower bound up to the end of the collection.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、その部分的な範囲の下側の境界からそのコレクションの終わりまでの範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, and including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、そしてそれを含んでいる範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, but not including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、しかしそれを含んでいない範囲を表すことができます。

source: You can use your own custom types as dictionary keys by making them conform to the Hashable protocol.
ja: あなたは、あなた独自のあつらえの型を辞書のキーとして使うことがそれらをHashableプロトコルに準拠させることによって可能です。

source: You can work with types declared in Swift from within the Objective-C code in your project by importing an Xcode-generated header file.
ja: あなたは、Swiftにおいて宣言される型をあなたのプロジェクトの中のObjective-Cコード内から扱うことが、Xcode生成のヘッダファイルをインポートすることによって可能です。

source: You can write generic methods that operate on any numeric type in the standard library by using the AdditiveArithmetic protocol as a generic constraint.
ja: あなたは、AdditiveArithmeticプロトコルを総称体制約として使うことで、標準ライブラリのあらゆる数値型上で作用する総称体メソッドを書くことができます。

source: You cannot use * with arguments of different types.
ja: あなたは、*をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use + with arguments of different types.
ja: あなたは、+をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use - with arguments of different types.
ja: あなたは、-をそれぞれが異なる型である引数で使うことはできません。

source: You cannot use a break or continue statement to exit the current call of the body closure or skip subsequent calls.
ja: あなたは、breakまたはcontinue文を使って、bodyクロージャの現在の呼び出しを抜け出したり、または続いて起こる呼び出しを飛ばしたりできません。

source: You can’t initialize a type that conforms to ExpressibleByArrayLiteral simply by assigning an existing array.
ja: あなたは、既存の配列を割り当てることでExpressibleByArrayLiteralに準拠する型を初期化することはできません。

source: You can’t initialize a type that conforms to ExpressibleByDictionaryLiteral simply by assigning an instance of Dictionary, KeyValuePairs, or similar.
ja: あなたは、ExpressibleByDictionaryLiteralに準拠する型を単純にDictionary、KeyValuePairs、または似たものを割り当てることによって初期化できません。

source: You choose which method to use based on whether the API you are invoking returns an unretained or a retained object.
ja: あなたはどちらかのメソッドを、あなたが呼んでいるAPIが、リテイン（保有）されないまたはリテインされるオブジェクトを返すのかに基づき選択して使用します。

source: You could use the id property to identify a particular user even if other data fields change, such as the user’s name.
ja: あなたは、そのidプロパティを使って、特定のユーザを識別できます、たとえ他のデータフィールド、たとえばそのユーザのもつ名前などが変わるとしてもです。

source: You create a ClosedRange instance by using the closed range operator (...).
ja: あなたは、ClosedRangeインスタンスを完結範囲演算子（...）を使って作成します。

source: You create simple singletons using a static type property, which is guaranteed to be lazily initialized only once, even when accessed across multiple threads simultaneously:
ja: あなたは単純なシングルトンをstatic型プロパティを使って作成できます、それはただ一度だけ遅延初期化されることを保証されます、たとえ複数のスレッドから同時にアクセスされる場合でさえもです：

source: You don’t need to do anything special to create the generated header—just import it to use its contents in your Objective-C code.
ja: あなたは、生成ヘッダを作成するために特に何もする必要はありません ― あなたは、ただ単にそれをインポートしてそれの内容をあなたのObjective-Cコードにおいて使います。

source: You might not anticipate the consequences of changing a heavily shared instance, so it's more work to write such code correctly.
ja: あなたは、重く共有されるインスタンスの変更の帰着を見越して備えられないかもしれません、それでそのようなコードを正しく書くためにさらに仕事が増えます。

source: You must call a resume method exactly once on every execution path throughout the program.
ja: あなたは、ある再開メソッドをあらゆる遂行経路上でそのプログラムの間を通して厳密に一度だけ呼び出さなければなりません。

source: You must not call this method if any other copy of this iterator has been advanced with a call to its next() method.
ja: あなたは、このイテレータの何か他のコピーがそれのnext()メソッドを呼び出すことで前に進められるならば、このメソッドを呼び出す必要はありません。

source: You must resume the continuation exactly once.
ja: あなたは、厳密に一度だけ継続を再開しなければなりません。

source: You must use only one kind of top-level encoding container.
ja: あなたは、ある種のトップレベルのエンコーディングコンテナのみを使う必要があります。

source: You need to manually implement Equatable and Hashable conformance for a type in these cases:
ja: あなたは、手動でEquatableとHashable準拠をある型に対して実装する必要がこれらの場合には必要です：

source: You only need to initialize your own CheckedContinuation<T, E> if you already have an UnsafeContinuation you want to impose checking on.
ja: あなたが唯一必要とするのはあなた独自のCheckedContinuation<T, E>です、もしあなたがそれの上に検査を課したいUnsafeContinuationをあなたが既に持つならば。

source: You should prefer withVaList(_:_:) instead of this function.
ja: あなたはこの関数よりもwithVaList(_:_:)を選ぶべきです。

source: You throw Cocoa errors by initializing a Cocoa error type and passing in the relevant error domain and code:
ja: あなたは、Cocoaエラーのスローを、あるCocoaエラー型を初期化して、関連エラー領域およびコードを渡すことによって行います：

source: You use AnyObject when you need the flexibility of an untyped object or when you use bridged Objective-C methods and properties that return an untyped result.
ja: あなたが型付けされないオブジェクトの柔軟性を必要とするとき、または型付けされない結果を返すブリッジされたObjective-Cメソッドやプロパティを使用するとき、あなたはAnyObjectを使います。

source: You use Swift's throw statement and do-catch statement to throw and catch errors from Cocoa APIs.
ja: あなたは、Swiftの持つthrow文とdo-catch文を使って、Cocoa APIからのエラーをスローおよびキャッチします。

source: You use arrays to organize your app’s data.
ja: あなたは配列を使ってあなたのアプリのデータを整理します。

source: You use complex macros in C and Objective-C to avoid type-checking constraints or to avoid retyping large amounts of boilerplate code.
ja: あなたは、複雑なマクロをCとObjective-Cにおいて型チェック制約を避けたり、常用文コードの大きな塊を繰り返しタイピングすることを避けるために使います。

source: You use custom error domains in Cocoa to group related categories of errors.
ja: あなたは、あつらえのエラー領域をCocoaにおいて使用して、関連するエラーのカテゴリをグループにまとめます。

source: You use delegates to interact with Cocoa objects that inform you of events in an app.
ja: あなたは委任先を使って、あるアプリの中のイベントについてあなたに告知するCocoaオブジェクトと相互作用します。

source: You use singletons to provide a globally accessible, shared instance of a class.
ja: あなたはシングルトンを使って、グローバルにアクセス可能な、あるクラスの共有インスタンスを提供します。

source: You use that key to retrieve the corresponding value, which can be any object.
ja: あなたはこのキーを使ってその対応している値を取り出すことができ、その値はあらゆるオブジェクトであることができます。

source: You use the NS_SWIFT_NOTHROW macro on Objective-C method declarations that produce an NSError to prevent it from being imported by Swift as a method that throws.
ja: あなたはNS_SWIFT_NOTHROWマクロを、NSErrorを生成するObjective-Cメソッド宣言上で使って、それがスローするメソッドとしてSwiftによってインポートされるのを防止します。

source: You use the oldValue and newValue properties of the NSKeyValueObservedChange instance to see what's changed about the property you're observing.
ja: あなたは、NSKeyValueObservedChangeインスタンスのoldValueとnewValueプロパティを使って、あなたが監視しているプロパティについて変更されるのが何か見ます。

source: You use the default init(_:) initializer to create a new instance when you’re sure that the value passed is representable in the new type.
ja: あなたは、省略時のinit(_:)イニシャライザを使って新しいインスタンスを作成するのは、渡される値が新しい型において表現可能であるとあなたが確信する場合です。

source: You use this initializer to create a dictionary when you have a sequence of key-value tuples that might have duplicate keys.
ja: あなたは、重複キーを持つかもしれないキー値タプルのシーケンスをあなたが持つ場合、このイニシャライザを使って辞書を作成してください。

source: You use this initializer to create a dictionary when you have a sequence of key-value tuples with unique keys.
ja: 特有なキーをもつキー値タプルのシーケンスをあなたが持つ場合、あなたはこのイニシャライザを使って辞書を作成してください。

source: You use this method to randomize the elements of a collection when you are using a custom random number generator.
ja: あなたはこのメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、あるコレクションの要素を無作為化します。

source: You use this method to randomize the elements of a sequence when you are using a custom random number generator.
ja: あなたはこのメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、あるシーケンスの要素を無作為化します。

source: You use this protocol to present a native Swift interface to a C “varargs” API.
ja: あなたは、このプロトコルを使ってSwift固有のインターフェースをC「varags」APIに贈呈します。

source: You want to compare the absences in the first half of the session with those in the second half.
ja: あなたは、前学期の欠席者を後半のそれと比較したいと思います。

source: You want to customize the type's conformance.
ja: あなたがその型の持つ準拠をカスタマイズしたい。

source: You want to extend a type declared in another file or module to conform.
ja: あなたが別のファイルまたはモジュールにおいて宣言される型を拡張することで準拠したい。

source: You write each key-value pair with a colon (:) separating the key and the value.
ja: あなたは、各キー値ペアをコロン（:）で区切るキーと値で書きます。

source: Your own custom types can be hashable as well.
ja: あなた独自のあつらえの型も同様にハッシュ化されることができます。

source: You’d like to create a set of the grid points where a user has already tapped.
ja: あなたは、ユーザがすでにタップしたところの格子点ひとそろいを作成したいでしょう。

source: You’re tasked with finding the day with the most absences in the second half of the session.
ja: あなたはこの学期の後半において最も多く欠席者がいる日付を見つける任務を負います。

source: Zero is a multiple of everything because 0 = 0*x for any integer x.
ja: ゼロはあらゆるものの倍数です、なぜなら0 = 0*xなので、どんな整数xに対してもです。

source: Zero is neither a normal nor a subnormal number.
ja: ゼロは、ノーマルでもサブノーマル数でもありません。

source: Zero is the identity element for addition.
ja: ゼロは加算に対する単位元です。

source: Zero or more additional values.
ja: ゼロ以上の追加の値。

source: Zero or more items to print.
ja: 出力するゼロ個以上の項目

source: an UnsafeMutablePointer<Pointee>, which is passed as-is.
ja: UnsafeMutablePointer<Pointee>、それは現品で渡されます。

source: an inout argument of the referenced type, which gets passed as a pointer to a writeback temporary with autoreleasing ownership semantics,
ja: 参照される型のインアウト引数、それはオートリリース所有権意味論を持つライトバックテンポラリへのポインタとして渡されます。

source: param container: The container in which the corrupted data was accessed.
ja: param container: そこで破壊されたデータがアクセスされたところのコンテナ。

source: param debugDescription: A description of the error to aid in debugging.
ja: param debugDescription: デバッグにおいて支援する目的のエラー解説。

source: param key: The key which caused the failure.
ja: param key: 失敗を引き起こしたキー。

source: “Pseudo-NaNs”, “pseudo-infinities”, and “unnormals” are interpreted as non-canonical NaN encodings.
ja: “Pseudo-NaN”、“pseudo-infinitie”、そして“unnormal”は、非正準NaNエンコーディングとして解釈されます。.

source: “Pseudo-denormals” are interpreted as non-canonical encodings of subnormal values.
ja: “Pseudo-denormal”は、非正規化数値の非正準エンコーディングとして解釈されます。
